app/Controllers/Admin/SportController.php

    public function index(): string
    {
        $keyword = $this->request->getGet('q');

        $builder = $this->sportModel->orderBy('nom', 'ASC');

        if ($keyword) {
            $builder->like('nom', $keyword);
        }

        $data = [
            'title'   => 'Liste des sports',
            'sports'  => $builder->paginate(10),
---
SELECT *
FROM `sport`
ORDER BY `nom` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `sport`

    public function show(int $id): string
    {
        $sport = $this->sportModel->find($id);
---
SELECT *
FROM `sport`
WHERE `sport`.`id` = 5