app/Controllers/Admin/UtilisateurController.php

    public function index(): string
    {
        $keyword = $this->request->getGet('q');
        // On récupère le rôle pour le filtre
        $roleFilter = $this->request->getGet('role');

        $builder = $this->utilisateurModel
            ->select('utilisateur.*, user_role.role AS role_label')
            ->join('user_role', 'user_role.id = utilisateur.id_role', 'left')
            ->orderBy('utilisateur.nom', 'ASC');

        if ($keyword) {
            $builder->groupStart()
                ->like('utilisateur.nom', $keyword)
                ->orLike('utilisateur.email', $keyword)
                ->groupEnd();
        }

        if ($roleFilter) {
            $builder->where('user_role.role', $roleFilter);
        }

        return view('admin/utilisateur/index', [
            'title'    => 'Gestion des utilisateurs',
            'subtitle' => 'Liste de tous les comptes enregistrés',
            'users'    => $builder->paginate(15),
            'pager'    => $this->utilisateurModel->pager,
            'keyword'  => $keyword,
            'roleFilter' => $roleFilter,
            'roles'    => $this->roleModel->findAll(),
---
SELECT COUNT(*) AS `numrows`
FROM `utilisateur`
LEFT JOIN `user_role` ON `user_role`.`id` = `utilisateur`.`id_role`
SELECT `utilisateur`.*, `user_role`.`role` AS `role_label`
FROM `utilisateur`
LEFT JOIN `user_role` ON `user_role`.`id` = `utilisateur`.`id_role`
ORDER BY `utilisateur`.`nom` ASC
 LIMIT 15
SELECT *
FROM `user_role`