app/Controllers/ObjectifController.php

SELECT *
FROM `type_objectif`
WHERE `type_objectif`.`id` = 1
---
        }

        $objectiveId = (int) $this->request->getPost('id_type_objectif');
        $objective = $this->typeObjectifModel->find($objectiveId);