app/Models/GoldConfigModel.php

SELECT *
FROM `gold_config`
WHERE `actif` = 1
 LIMIT 1
---
    public function getActiveConfig(): array|null
    {
        return $this->where('actif', 1)->first();