app/Models/InterpretationImcModel.php

    public function findAllOrdered(): array
    {
        $interpretations = $this->findAll();
---
SELECT *
FROM `interpretation_imc`