app/Models/RegimeModel.php

SELECT `regime`.*, `regime_detail`.`duree`, `regime_detail`.`prix`, `regime_detail`.`variation_poids`
FROM `regime`
JOIN `regime_detail` ON `regime_detail`.`id_regime` = `regime`.`id`
---
    public function getAllDetails()
    {
        return $this->select('regime.*, regime_detail.duree, regime_detail.prix, regime_detail.variation_poids')
                    ->join('regime_detail', 'regime_detail.id_regime = regime.id')
                    ->findAll();