app/Models/RegimeDetailModel.php

SELECT `regime`.`id` AS `regime_id`, `regime_detail`.`id` AS `detail_id`, `regime_detail`.*, `regime`.`nom`, `regime`.`pct_viande`, `regime`.`pct_poisson`, `regime`.`pct_volaille`
FROM `regime_detail`
JOIN `regime` ON `regime`.`id` = `regime_detail`.`id_regime`
WHERE `regime_detail`.`variation_poids` < 0
---
    public function getSuggestions($diffPoids)
    {
        if ((float) $diffPoids === 0.0) {
            return [];
        }

        $builder = $this->db->table($this->table);
        $builder->select('regime.id AS regime_id, regime_detail.id AS detail_id, regime_detail.*, regime.nom, regime.pct_viande, regime.pct_poisson, regime.pct_volaille');
        $builder->join('regime', 'regime.id = regime_detail.id_regime');

        // Filtrage par sens de variation
        if ($diffPoids > 0) {
            $builder->where('regime_detail.variation_poids >', 0);
        } else {
            $builder->where('regime_detail.variation_poids <', 0);
        }

        $results = $builder->get()->getResultArray();