app/Models/TypeObjectifModel.php

SELECT *
FROM `type_objectif`
---
    public function findAllOrdered(): array
    {
        $items = $this->findAll();