app/Models/UtilisateurModel.php

    public function findByEmailWithRole(string $email): ?array
    {
        return $this->select('utilisateur.*, user_role.role AS role_label')
            ->join('user_role', 'user_role.id = utilisateur.id_role', 'left')
            ->where('utilisateur.email', $email)
            ->first();
---
SELECT `utilisateur`.*, `user_role`.`role` AS `role_label`
FROM `utilisateur`
LEFT JOIN `user_role` ON `user_role`.`id` = `utilisateur`.`id_role`
WHERE `utilisateur`.`email` = 'alice@mail.com'
 LIMIT 1

    public function getAdminLoginData(): ?array
    {
        return $this->select('utilisateur.id, utilisateur.nom, utilisateur.email, user_role.role AS role_label')
            ->join('user_role', 'user_role.id = utilisateur.id_role', 'left')
            ->where('user_role.role', 'admin')
            ->first();
---
SELECT `utilisateur`.`id`, `utilisateur`.`nom`, `utilisateur`.`email`, `user_role`.`role` AS `role_label`
FROM `utilisateur`
LEFT JOIN `user_role` ON `user_role`.`id` = `utilisateur`.`id_role`
WHERE `user_role`.`role` = 'admin'
 LIMIT 1